import Taccidentm from "./Taccidentm";

const Taccident = () => {
    const apiData = {
        "currentCount": 15,
        "data": [
          {
            "경상자수": "7488",
            "부상신고자수": "701",
            "사고건수": "17544",
            "사고유형_대분류": "차대사람",
            "사고유형_중분류": "횡단중",
            "사망자수": "883",
            "중상자수": "9649"
          },
          {
            "경상자수": "1475",
            "부상신고자수": "161",
            "사고건수": "3059",
            "사고유형_대분류": "차대사람",
            "사고유형_중분류": "차도통행중",
            "사망자수": "146",
            "중상자수": "1425"
          },
          {
            "경상자수": "1754",
            "부상신고자수": "202",
            "사고건수": "2872",
            "사고유형_대분류": "차대사람",
            "사고유형_중분류": "길가장자리구역통행중",
            "사망자수": "80",
            "중상자수": "994"
          },
          {
            "경상자수": "1239",
            "부상신고자수": "121",
            "사고건수": "2188",
            "사고유형_대분류": "차대사람",
            "사고유형_중분류": "보도통행중",
            "사망자수": "45",
            "중상자수": "1005"
          },
          {
            "경상자수": "13049",
            "부상신고자수": "1743",
            "사고건수": "24652",
            "사고유형_대분류": "차대사람",
            "사고유형_중분류": "기타",
            "사망자수": "689",
            "중상자수": "10584"
          },
          {
            "경상자수": "6506",
            "부상신고자수": "590",
            "사고건수": "5840",
            "사고유형_대분류": "차대차",
            "사고유형_중분류": "정면충돌",
            "사망자수": "259",
            "중상자수": "3991"
          },
          {
            "경상자수": "63749",
            "부상신고자수": "5446",
            "사고건수": "56935",
            "사고유형_대분류": "차대차",
            "사고유형_중분류": "측면충돌",
            "사망자수": "555",
            "중상자수": "23105"
          },
          {
            "경상자수": "61766",
            "부상신고자수": "4576",
            "사고건수": "43028",
            "사고유형_대분류": "차대차",
            "사고유형_중분류": "추돌",
            "사망자수": "504",
            "중상자수": "15068"
          },
          {
            "경상자수": "60009",
            "부상신고자수": "5793",
            "사고건수": "56378",
            "사고유형_대분류": "차대차",
            "사고유형_중분류": "기타",
            "사망자수": "596",
            "중상자수": "21548"
          },
          {
            "경상자수": "2572",
            "부상신고자수": "769",
            "사고건수": "4292",
            "사고유형_대분류": "차량단독",
            "사고유형_중분류": "공작물충돌",
            "사망자수": "462",
            "중상자수": "2442"
          },
          {
            "경상자수": "369",
            "부상신고자수": "74",
            "사고건수": "673",
            "사고유형_대분류": "차량단독",
            "사고유형_중분류": "도로이탈",
            "사망자수": "144",
            "중상자수": "457"
          },
          {
            "경상자수": "13",
            "부상신고자수": "5",
            "사고건수": "28",
            "사고유형_대분류": "차량단독",
            "사고유형_중분류": "주/정차차량 충돌",
            "사망자수": "5",
            "중상자수": "15"
          },
          {
            "경상자수": "809",
            "부상신고자수": "353",
            "사고건수": "1558",
            "사고유형_대분류": "차량단독",
            "사고유형_중분류": "전도전복",
            "사망자수": "226",
            "중상자수": "886"
          },
          {
            "경상자수": "2577",
            "부상신고자수": "541",
            "사고건수": "4503",
            "사고유형_대분류": "차량단독",
            "사고유형_중분류": "기타",
            "사망자수": "168",
            "중상자수": "1876"
          },
          {
            "경상자수": "0",
            "부상신고자수": "0",
            "사고건수": "2",
            "사고유형_대분류": "철길건널목",
            "사고유형_중분류": "기타",
            "사망자수": "0",
            "중상자수": "2"
          }
        ],
        "matchCount": 15,
        "page": 1,
        "perPage": 20,
        "totalCount": 15

      } ;

    //console.log("apiData", apiData)
    //apiData : object type

    //세부내용 순회하는건 무조건 for문
    //for...in : object type 데이터의 key값 옴
    /*
    for(let item in apiData) {
      //console.log("apiData_item", item);
    }

    for(let item in Object.keys(apiData)){
     // console.log("apiData_KEY", item);
    }

    for(let item in Object.values(apiData)){
    //  console.log("apiData_value", item);
    }
*/
    let c1, c2, data;

    //data : 상세 데이터
    data = apiData.data;
    //console.log("data", data)

    //c1[] : 대분류
    c1 = data.map((item) => item["사고유형_대분류"]);  //"사고유형_대분류"의 값을 하나씩 가져와서 배열로 만들어줌
    //console.log("c1", c1)                             //c1은 data 15개의 array
    c1 = new Set(c1);                                 //c1의 중복제거, 타입 : set
    //console.log("중복제거 c1", c1);
    c1 = [...c1];                                    //set을 다시 배열로
    console.log("배열변환c1", c1);

    //c2[,] : 중분류
    //c2 = data.map((item)=>item["사고유형_중분류"]);   
    //"사고유형_중분류"의 값을 하나씩 가져와서 배열로 만들어주면 대분류당 기타가 구분이 안됨

    c2 = [];
    for(let item of data) {
      let temp = []; 
      temp.push(item.사고유형_대분류);
      temp.push(item.사고유형_중분류);
      c2.push(temp);
    };

    /*방법 2*/

    console.log("c2", c2);
    
    //중분류를 대분류key로 가져올 수 없나..? (코드는 수정)
    // for (let [idx, k] of c1.entries()) {
    // //      console.log('idx=', idx, 'key_value=', k, 'cn_value=', frccn[idx]);
    //         c2obj[k] = c2[idx];
    // }
/*
    let cobj2 ={};
    for(let [k,v] of c1.entries()) {
 
      cobj2[v] = (cobj2[v] + ',' + c2[k]).split(',')
      //cobj2[v].pop(0);
      console.log("a", (cobj2[v] , ',' , c2[k]))
      console.log("b", (cobj2[v] + ',' + c2[k]))

    }
      console.log(cobj2);

*/
    return (
        <>
          <Taccidentm c1 = {c1} c2 = {c2} data = {data}/>
        </>
    ) ;
}

export default Taccident ;